
#Задание 1:
N = input("Как Вас зовут?") #ввод имя
print('Привет', N) #Приветствие по имени
A = input("сколько Вам лет?") #Ввод возраста
print(N,'тебе',A,'лет') #Вывод сообщения с двумя переменными