# 7. Создать (не программно) текстовый файл, в котором каждая строка должна содержать данные о фирме:
# название, форма собственности, выручка, издержки.
# Пример строки файла: firm_1 ООО 10000 5000.
# Необходимо построчно прочитать файл, вычислить прибыль каждой компании, а также среднюю прибыль.
# Если фирма получила убытки, в расчет средней прибыли ее не включать.
# Далее реализовать список. Он должен содержать словарь с фирмами и их прибылями, а также словарь со средней прибылью.
# Если фирма получила убытки, также добавить ее в словарь (со значением убытков).
# Пример списка: [{“firm_1”: 5000, “firm_2”: 3000, “firm_3”: 1000}, {“average_profit”: 2000}].
# Итоговый список сохранить в виде json-объекта в соответствующий файл.
# Пример json-объекта:
# [{"firm_1": 5000, "firm_2": 3000, "firm_3": 1000}, {"average_profit": 2000}]
#
# Подсказка: использовать менеджеры контекста.

import json
dirt_file = {}
pr = {}
prof = 0
prof_aver = 0
i = 0
with open('text_05_007.txt', 'r') as file:
    for line in file:
        name, firm, earning, damage = line.split()
        dirt_file[name] = int(earning) - int(damage)
        if dirt_file.setdefault(name) >= 0:
            prof = prof + dirt_file.setdefault(name)
            i += 1
    if i != 0:
        prof_aver = prof / i
        print(f'Прибыль средняя - {prof_aver:.2f}')
    else:
        print(f'Прибыль средняя - отсутсвует. Все работают в убыток')
    pr = {'средняя прибыль': round(prof_aver)}
    dirt_file.update(pr)
    print(f'Прибыль каждой компании - {dirt_file}')

with open('text_05_007.json', 'w') as write_js:
    json.dump(dirt_file, write_js)

    js_str = json.dumps(dirt_file)
    print(f'Создан файл с расширением json со следующим содержимым: \n '
          f' {js_str}')